In [2]:
import numpy as np
import pandas as pd
list_1=['a','b','c','d']
labels=[1,2,3,4]
ser_1=pd.Series(data=list_1,index=labels)
ser_1

1    a
2    b
3    c
4    d
dtype: object

In [3]:
arr_1=np.array([1,2,3,4])
ser_2=pd.Series(arr_1)
ser_2

0    1
1    2
2    3
3    4
dtype: int32

In [9]:
ser_2.dtype

dtype('int32')

In [10]:
ser_2+ser_2

0    2
1    4
2    6
3    8
dtype: int32

In [11]:
ser_2-ser_2

0    0
1    0
2    0
3    0
dtype: int32

In [12]:
ser_2/ser_2

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [13]:
ser_2*ser_2

0     1
1     4
2     9
3    16
dtype: int32

In [14]:
np.exp(ser_2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [4]:
#creating dictionary
dic_1={'f_name':'Vijay','l_name':"S",'age':31}
ser_3=pd.Series(dic_1)

ser_3

f_name    Vijay
l_name        S
age          31
dtype: object

In [6]:
ser_3['f_name']

'Vijay'

In [7]:
ser_3['l_name']

'S'

In [8]:
ser_3['age']

31

In [15]:
ser_4=pd.Series({4:5,5:6,6:7,7:8},name='random')
ser_4

4    5
5    6
6    7
7    8
Name: random, dtype: int64

In [16]:
ser_4.name

'random'

In [ ]:
#DataFrames
#Creating DataFrames

In [18]:
#Creating random array with numpy

arr_2=np.random.randint(10,50,size=(2,3))
arr_2

array([[38, 33, 18],
       [36, 37, 29]])

In [19]:
#creating dataframe with pandas
df_1=pd.DataFrame(arr_2,['A','B'],['C','D','E'])
df_1

    C   D   E
A  38  33  18
B  36  37  29

In [28]:
#getting columns
df_1['C']

A    38
B    36
Name: C, dtype: int32

In [31]:
#getting two column from dataframe
df_1[['C','D']]

    C   D
A  38  33
B  36  37

In [32]:
#getting row with columns

df_1.loc['A']

C    38
D    33
E    18
Name: A, dtype: int32

In [34]:
#getting rows with column number
df_1.iloc[1]

C    36
D    37
E    29
Name: B, dtype: int32

In [35]:
#specific information with row and column name

df_1.loc['A','C']

38

In [36]:
#getting information with multiple rows and columns
df_1.loc[['A','B'],['D','E']]

    D   E
A  33  18
B  37  29

In [40]:
#creating new column with adding multiple columns
df_1['Total']=df_1['C']+df_1['D']+df_1['E']
df_1

    C   D   E  Total
A  38  33  18     89
B  36  37  29    102

In [46]:
#creating dictionary
dict_2={'C':44,'D':12,'E':25}
#creating new row
new_row=pd.Series(dict_2,name='F')
new_row

C    44
D    12
E    25
Name: F, dtype: int64

In [48]:
#adding a row in a dataframe
df_1=df_1.append(new_row)
df_1

      C     D     E  Total
A  38.0  33.0  18.0   89.0
B  36.0  37.0  29.0  102.0
F  44.0  12.0  25.0    NaN
F  44.0  12.0  25.0    NaN

In [41]:
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [43]:
#multiplying two column and getting information in new column
df_2['Multi']=df_2['one']*df_2['two']
df_2

   one  two  Multi
a  1.0  1.0    1.0
b  2.0  2.0    4.0
c  3.0  3.0    9.0
d  NaN  4.0    NaN

In [27]:
#type of dataframe

df_1.shape

(2, 3)

In [21]:
#creating dictionary
dic_3={'one':pd.Series([1.,2.,3.],index=['a','b','c']),
       'two':pd.Series([1.,2.,3.,4.],index=['a','b','c','d'])}
dic_3

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [23]:
#Creating dataframe with dictionary and pandas
df_2=pd.DataFrame(dic_3)
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [25]:
#from_dict
pd.DataFrame.from_dict(dict([('A',[1,5,7]),('B',[4,6,8] ) ] ))

   A  B
0  1  4
1  5  6
2  7  8

In [26]:
#creating datafrome with index orientation and column name
pd.DataFrame.from_dict(dict([('A',[1,5,7]),('B',[4,6,8] ) ] ),
                      orient='index',columns=['one','two','three'])

   one  two  three
A    1    5      7
B    4    6      8